{
    "hello": "Hi there! How can I assist you today?",
    "hi": "Hello! How can I help you?",
    "how are you": "I'm doing great, thank you for asking!",
    "what is your name": "I am a chatbot. I don't have a specific name.",
    "bye": "Goodbye! Have a great day!",
    "what is your purpose": "My purpose is to assist you with various tasks and answer your questions.",
    "how can I help you": "You can ask me any question, and I will do my best to help!",
    "what can you do": "I can answer questions, provide information, and chat with you about various topics.",
    "who are you": "I am a chatbot designed to help you with your questions.",
    "where are you from": "I exist on the internet, so I don't have a physical location.",
    "what is the time": "Sorry, I don't have access to real-time data like the current time.",
    "what is the date": "Sorry, I don't have access to real-time data like the current date.",
    "how old are you": "I don't age since I am just a chatbot.",
    "can you help me": "Yes, I can help you! Just let me know what you need assistance with.",
    "tell me a joke": "Why don't skeletons fight each other? They don't have the guts!",
    "what is your favorite color": "I don't have preferences, but blue is a popular color!",
    "what is your favorite food": "I don't eat food, but I know a lot about different dishes!",
    "can you speak other languages": "I can understand and respond in multiple languages!",
    "do you know my name": "I don't know your name unless you tell me.",
    "what is the weather today": "Sorry, I don't have access to real-time weather information.",
    "can you play music": "I can't play music, but I can recommend songs if you'd like.",
    "what is the capital of France": "The capital of France is Paris.",
    "what is the largest ocean": "The largest ocean is the Pacific Ocean.",
    "what is the tallest mountain": "The tallest mountain is Mount Everest.",
    "who is the president of the United States": "The president of the United States is Joe Biden.",
    "what is the currency of Japan": "The currency of Japan is the Japanese Yen.",
    "how many continents are there": "There are 7 continents on Earth.",
    "what is the fastest animal": "The fastest animal is the cheetah.",
    "who wrote 'Romeo and Juliet'": "William Shakespeare wrote 'Romeo and Juliet'.",
    "what is the square root of 64": "The square root of 64 is 8.",
    "who invented the light bulb": "Thomas Edison is credited with inventing the light bulb.",
    "what is the longest river in the world": "The Nile River is the longest river in the world.",
    "who discovered America": "Christopher Columbus is credited with discovering America.",
    "when did World War II end": "World War II ended in 1945.",
    "how many planets are in our solar system": "There are 8 planets in our solar system.",
    "what is the chemical symbol for water": "The chemical symbol for water is H2O.",
    "how many states are in the United States": "There are 50 states in the United States.",
    "who was the first man on the moon": "Neil Armstrong was the first man on the moon.",
    "what is the smallest country in the world": "The smallest country in the world is Vatican City.",
    "what is the largest country by area": "The largest country by area is Russia.",
    "what is the population of China": "As of 2023, the population of China is over 1.4 billion.",
    "what is the speed of light": "The speed of light is approximately 299,792 kilometers per second.",
    "what is a computer virus": "A computer virus is a malicious software program that can damage or disrupt computer systems.",
    "what is artificial intelligence": "Artificial intelligence refers to the simulation of human intelligence in machines.",
    "how do you spell 'accommodate'": "The correct spelling is 'accommodate'.",
    "can you solve math problems": "Yes, I can solve many types of math problems.",
    "what is the capital of India": "The capital of India is New Delhi.",
    "how many hours in a day": "There are 24 hours in a day.",
    "what is the largest mammal": "The largest mammal is the blue whale.",
    "what is the currency of the United Kingdom": "The currency of the United Kingdom is the British Pound.",
    "how many days in a year": "There are 365 days in a year, except for leap years which have 366 days.",
    "who is the CEO of Tesla": "Elon Musk is the CEO of Tesla.",
    "what is the boiling point of water": "The boiling point of water is 100°C (212°F) at sea level.",
    "can you help with homework": "Yes, I can help with homework. What subject are you working on?",
    "what is the meaning of life": "The meaning of life is a philosophical question, and different people may have different answers.",
    "what is 2+2": "2 + 2 equals 4.",
    "can you tell me a fact": "Sure! Did you know that honey never spoils? Archaeologists have found pots of honey in ancient tombs that are over 3,000 years old.",
    "is the Earth flat": "No, the Earth is not flat. It is an oblate spheroid.",
    "what is the largest city in the world": "The largest city in the world by population is Tokyo, Japan.",
    "how many bones are in the human body": "The human body has 206 bones.",
    "what is the fastest bird": "The fastest bird is the peregrine falcon.",
    "who is the author of Harry Potter": "J.K. Rowling is the author of the Harry Potter series.",
    "what is the smallest planet in our solar system": "The smallest planet in our solar system is Mercury.",
    "what is the biggest animal in the world": "The biggest animal in the world is the blue whale.",
    "what is the capital of Germany": "The capital of Germany is Berlin.",
    "who invented the telephone": "Alexander Graham Bell is credited with inventing the telephone.",
    "what is the currency of the United States": "The currency of the United States is the U.S. Dollar.",
    "who painted the Mona Lisa": "Leonardo da Vinci painted the Mona Lisa.",
    "how many teeth does an adult human have": "An adult human typically has 32 teeth.",
    "what is the tallest building in the world": "The tallest building in the world is the Burj Khalifa in Dubai, United Arab Emirates.",
    "who is the founder of Microsoft": "Bill Gates and Paul Allen are the founders of Microsoft.",
    "what is the national animal of India": "The national animal of India is the Bengal tiger.",
    "what is a black hole": "A black hole is a region in space where gravity is so strong that not even light can escape it.",
    "can you tell me a story": "Sure! Once upon a time, in a faraway land, there was a brave knight who...",
    "what is IITRAM": "IITRAM stands for the Indian Institute of Technology, Research and Management, located in Ahmedabad, India.",
    "where is IITRAM located": "IITRAM is located in Ahmedabad, Gujarat, India.",
      "what programs are offered at IITRAM": "IITRAM offers undergraduate, postgraduate, and doctoral programs in various fields of engineering, technology, and management.",
      "who is the director of IITRAM": "The current director of IITRAM is Dr. Mukesh Barua.",
      "when was IITRAM established": "IITRAM was established in 2013.",
      "is IITRAM part of IITs": "IITRAM is not part of the IIT system but is an autonomous institute set up by the Government of Gujarat.",
      "what is the campus size of IITRAM": "IITRAM's campus spans over a large area in Ahmedabad, providing state-of-the-art infrastructure and facilities for students and faculty.",
      "what is the ranking of IITRAM": "As of now, IITRAM is not ranked among the top IITs, but it is growing rapidly and is known for its strong research focus and industry collaboration.",
      "does IITRAM offer PhD programs": "Yes, IITRAM offers PhD programs in various fields of engineering and technology.",
      "how can I apply to IITRAM": "To apply to IITRAM, you need to visit the official website and follow the admission process for undergraduate or postgraduate programs, which may include entrance exams and interviews.",
      "what are the admission requirements for IITRAM": "Admission requirements for IITRAM typically include passing an entrance exam, academic performance, and meeting the eligibility criteria for the specific program.",
      "does IITRAM have a hostel": "Yes, IITRAM provides hostel facilities for its students, with separate accommodations for male and female students.",
      "how is the faculty at IITRAM": "IITRAM has a highly qualified faculty with strong academic backgrounds and industry experience in various fields.",
      "what is the IITRAM campus known for": "IITRAM's campus is known for its modern infrastructure, research facilities, and an encouraging environment for learning and innovation.",
      "what are the research areas at IITRAM": "IITRAM focuses on various research areas, including but not limited to, engineering, technology, and management, with interdisciplinary approaches to solving real-world problems.",
      "what are the facilities available at IITRAM": "IITRAM offers modern classrooms, labs, library facilities, hostels, sports complexes, and recreational areas for students and faculty.",
      "does IITRAM have industry collaborations": "Yes, IITRAM has strong industry collaborations, allowing students to gain practical exposure and undertake projects that bridge academia and industry.",
      "is there any entrepreneurship support at IITRAM": "Yes, IITRAM provides support for entrepreneurship through innovation centers, incubation programs, and mentorship for aspiring student entrepreneurs.",
      "how is the placement at IITRAM": "IITRAM has a dedicated placement cell that ensures excellent placement opportunities for its students in top companies across various sectors.",
      "does IITRAM offer internships": "Yes, IITRAM facilitates internships for its students as part of their academic curriculum to gain industry experience.",
      "is there a student club at IITRAM": "Yes, IITRAM has various student clubs and societies focusing on different aspects such as academics, sports, culture, and entrepreneurship.",
      "what is the student life like at IITRAM": "Student life at IITRAM is vibrant, with various extracurricular activities, cultural events, and academic opportunities that foster holistic development.",
      "what are the key highlights of IITRAM": "Key highlights of IITRAM include its modern campus, strong academic programs, research output, industry partnerships, and a growing reputation in the field of engineering and technology education.",
      "how many students are enrolled at IITRAM": "IITRAM has a growing number of students enrolled across undergraduate, postgraduate, and doctoral programs.",
      "what is the faculty-student ratio at IITRAM": "IITRAM maintains a good faculty-student ratio to ensure personalized attention and mentorship for students.",
      "what is iitram": "IITRAM stands for the Indian Institute of Technology, Research and Management, located in Ahmedabad, India.",
      "where is iitram located": "IITRAM is located in Ahmedabad, Gujarat, India.",
      "what programs are offered at iitram": "IITRAM offers undergraduate, postgraduate, and doctoral programs in various fields of engineering, technology, and management.",
      "who is the director of iitram": "The current director of IITRAM is Dr. Mukesh Barua.",
      "when was iitram established": "IITRAM was established in 2013.",
      "is iitram part of iits": "IITRAM is not part of the IIT system but is an autonomous institute set up by the Government of Gujarat.",
      "what is the campus size of iitram": "IITRAM's campus spans over a large area in Ahmedabad, providing state-of-the-art infrastructure and facilities for students and faculty.",
      "what is the ranking of iitram": "As of now, IITRAM is not ranked among the top IITs, but it is growing rapidly and is known for its strong research focus and industry collaboration.",
      "does iitram offer phd programs": "Yes, IITRAM offers PhD programs in various fields of engineering and technology.",
      "how can i apply to iitram": "To apply to IITRAM, you need to visit the official website and follow the admission process for undergraduate or postgraduate programs, which may include entrance exams and interviews.",
      "what are the admission requirements for iitram": "Admission requirements for IITRAM typically include passing an entrance exam, academic performance, and meeting the eligibility criteria for the specific program.",
      "does iitram have a hostel": "Yes, IITRAM provides hostel facilities for its students, with separate accommodations for male and female students.",
      "how is the faculty at iitram": "IITRAM has a highly qualified faculty with strong academic backgrounds and industry experience in various fields.",
      "what is the iitram campus known for": "IITRAM's campus is known for its modern infrastructure, research facilities, and an encouraging environment for learning and innovation.",
      "what are the research areas at iitram": "IITRAM focuses on various research areas, including but not limited to, engineering, technology, and management, with interdisciplinary approaches to solving real-world problems.",
      "what are the facilities available at iitram": "IITRAM offers modern classrooms, labs, library facilities, hostels, sports complexes, and recreational areas for students and faculty.",
      "does iitram have industry collaborations": "Yes, IITRAM has strong industry collaborations, allowing students to gain practical exposure and undertake projects that bridge academia and industry.",
      "is there any entrepreneurship support at iitram": "Yes, IITRAM provides support for entrepreneurship through innovation centers, incubation programs, and mentorship for aspiring student entrepreneurs.",
      "how is the placement at iitram": "IITRAM has a dedicated placement cell that ensures excellent placement opportunities for its students in top companies across various sectors.",
      "does iitram offer internships": "Yes, IITRAM facilitates internships for its students as part of their academic curriculum to gain industry experience.",
      "is there a student club at iitram": "Yes, IITRAM has various student clubs and societies focusing on different aspects such as academics, sports, culture, and entrepreneurship.",
      "what is the student life like at iitram": "Student life at IITRAM is vibrant, with various extracurricular activities, cultural events, and academic opportunities that foster holistic development.",
      "what are the key highlights of iitram": "Key highlights of IITRAM include its modern campus, strong academic programs, research output, industry partnerships, and a growing reputation in the field of engineering and technology education.",
      "what is the motto of iitram": "The motto of IITRAM is to provide high-quality technical education and create a positive impact on society through innovation and research.",
      "does iitram have sports facilities": "Yes, IITRAM offers sports facilities, including a sports complex and spaces for indoor and outdoor games.",
      "what extracurricular activities are available at iitram": "IITRAM offers various extracurricular activities, including cultural fests, technical events, student clubs, and sports competitions.",
      "how is the library at iitram": "The library at IITRAM is well-equipped with a wide range of books, journals, and digital resources for students and faculty.",
      "what kind of events are organized at iitram": "IITRAM organizes a variety of events, including technical fests, cultural programs, seminars, workshops, and guest lectures by industry leaders.",
      "does iitram offer scholarships": "Yes, IITRAM provides scholarships and financial aid to deserving students based on academic performance and other criteria.",
      "what is the fee structure at iitram": "The fee structure for different programs at IITRAM varies. Detailed information is available on the official website.",
      "does iitram have a research center": "Yes, IITRAM has research centers focusing on cutting-edge technologies and collaborative research initiatives.",
      "what are the notable achievements of iitram": "IITRAM has made notable achievements in academic excellence, research contributions, and industry collaborations, enhancing its reputation.",
      "what is the admission process for b.tech at iitram": "Admission to the B.Tech program at IITRAM is typically based on entrance exam scores such as JEE Main, followed by counseling and seat allocation.",
      "can i transfer to iitram from another college": "The possibility of transferring to IITRAM from another college depends on the institute's policies and procedures for lateral entry or transfer students.",
      "how is the alumni network of iitram": "IITRAM has an active and growing alumni network that contributes to mentoring students and facilitating industry connections.",
      "what types of engineering programs are offered at iitram": "IITRAM offers undergraduate and postgraduate programs in various engineering disciplines, including civil, mechanical, and electrical engineering.",
      "what is the dress code for students at iitram": "There is no strict dress code at IITRAM, but students are expected to dress modestly and appropriately for academic activities.",
      "what is the role of the dean of alumni affairs at iitram": "The Dean of Alumni Affairs at IITRAM, Dr. Manish Sharma, is responsible for maintaining connections with alumni and engaging them in institutional development.",
      "is there a counseling service at iitram": "Yes, IITRAM provides counseling services to support students' mental health and overall well-being.",
      "what is the academic calendar for iitram": "The academic calendar for IITRAM, including the schedule for semesters, exams, and vacations, is published on the official website.",
      "does iitram provide online learning opportunities": "Yes, IITRAM offers online learning modules and resources to complement traditional classroom-based education.",
      "how is the food in the iitram mess": "The IITRAM mess provides a variety of nutritious meals, catering to the diverse tastes and dietary needs of students.",
      "are there exchange programs at iitram": "IITRAM collaborates with various institutions for exchange programs and academic partnerships, enabling students to gain international exposure.",
      "what is the placement success rate at iitram": "IITRAM's placement cell works to maintain a high placement success rate by connecting students with top recruiters.",
      "does iitram have a coding club": "Yes, IITRAM has a coding club where students can enhance their programming skills through competitions, workshops, and projects.",
      "is there a robotics club at iitram": "Yes, IITRAM has a robotics club that allows students to work on innovative projects and participate in competitions.",
      "what kind of projects do students work on at iitram": "Students at IITRAM work on various academic and research projects, often focusing on practical applications and industry collaboration.",
      "how can i contact the iitram admission office": "You can contact the IITRAM admission office through their official phone number or email address listed on the institute's website.",
      "is there an annual cultural festival at iitram": "Yes, IITRAM organizes an annual cultural festival where students showcase their talents through music, dance, drama, and other cultural activities.",
      "does iitram provide transportation facilities": "Yes, IITRAM provides transportation facilities for students and staff commuting from different parts of Ahmedabad.",
      "what is the teaching methodology at iitram": "IITRAM employs a mix of traditional and modern teaching methodologies, including lectures, practical sessions, project-based learning, and industry interaction.",
      "does iitram offer mba programs": "Currently, IITRAM primarily focuses on engineering and technology programs, but it may have initiatives or collaborations in management education.",
      "what is the grading system at iitram": "IITRAM follows a credit-based grading system for evaluating student performance across different courses.",
      "does iitram provide wi-fi on campus": "Yes, IITRAM provides Wi-Fi connectivity throughout the campus for students and faculty.",
      "how can i access the iitram library resources": "Students and faculty can access the library resources through physical visits, as well as online portals for e-books and journals."
  }